In [1]:
import pandas as pd

In [8]:
data=pd.read_csv(r"C:\Users\asdf\Documents\D.S\INEURON-PROJECTS\Restaurant-Rating-Prediction\Artifacts\row_data.csv",header=0)

In [9]:
data.head()

,Unnamed: 0,online_order,book_table,rate,votes,rest_type,cost,type,city
0,0,Yes,Yes,4,775,Casual Dining,800,Buffet,Banashankari
1,1,Yes,No,4,787,Casual Dining,800,Buffet,Banashankari
2,2,Yes,No,4,918,Other Rest Type,800,Buffet,Banashankari
3,3,No,No,4,88,Quick Bites,300,Buffet,Banashankari
4,4,No,No,4,166,Casual Dining,600,Buffet,Banashankari

In [10]:
data=data.drop("Unnamed: 0",axis=1)

In [13]:
data.head()

,online_order,book_table,rate,votes,rest_type,cost,type,city
0,Yes,Yes,4,775,Casual Dining,800,Buffet,Banashankari
1,Yes,No,4,787,Casual Dining,800,Buffet,Banashankari
2,Yes,No,4,918,Other Rest Type,800,Buffet,Banashankari
3,No,No,4,88,Quick Bites,300,Buffet,Banashankari
4,No,No,4,166,Casual Dining,600,Buffet,Banashankari

In [11]:
data.isnull().sum()

online_order    0
book_table      0
rate            0
votes           0
rest_type       0
cost            0
type            0
city            0
dtype: int64

In [12]:
data["city"].value_counts()

city
Bannerghatta Road    1617
Basavanagudi         1266
Bellandur            1227
Banashankari          863
Brigade Road           26
Name: count, dtype: int64